Revit 2024 API
SaveOptions Constructor
 Default constructor.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public SaveOptions()
Visual Basic
Public Sub New
Visual C++
public:
SaveOptions()
Remarks
 PreviewViewId will be InvalidElementId.
See Also
SaveOptions Class
Autodesk.Revit.DB Namespace